tutorials/rigidBodyAndBeam_shortTime/0/beam/CQTheta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      CQTheta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
59
(
(2.8878e-24 0.00628365 6.14441e-19 -0.00628365 -8.1109e-26 -150.796 -5.45118e-19 150.796 -2.80671e-24)
(2.55711e-24 0.00604156 -2.19449e-19 -0.00604156 5.7632e-24 -150.796 2.83263e-19 150.796 -8.32027e-24)
(2.44624e-24 0.00584098 2.73025e-19 -0.00584098 -5.57354e-24 -150.796 -2.09864e-19 150.796 3.12726e-24)
(2.69262e-24 0.00561556 -1.39658e-20 -0.00561556 -1.57299e-24 -150.796 8.62665e-20 150.796 -1.1196e-24)
(2.31491e-24 0.00540501 1.36707e-19 -0.00540501 3.24747e-24 -150.796 -7.21199e-20 150.796 -5.56228e-24)
(2.41598e-24 0.00518556 5.02462e-20 -0.00518556 3.06101e-24 -150.796 2.00087e-20 150.796 -5.47698e-24)
(1.87321e-24 0.00497144 7.69821e-20 -0.00497144 -1.30648e-23 -150.796 -2.0162e-20 150.796 1.11915e-23)
(2.34781e-24 0.00475413 6.10505e-20 -0.00475413 -2.94158e-24 -150.796 1.34191e-20 150.796 5.9369e-25)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-2.99928e-24 -0.00645637 7.95396e-19 0.00645637 -6.17103e-25 150.796 -8.65404e-19 -150.796 3.61636e-24);
    }
    right
    {
        type            calculated;
        value           uniform (6.51481e-25 -0.00645637 8.23797e-19 0.00645637 6.49228e-25 -150.796 -8.38995e-19 150.796 -1.30062e-24);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
